garyPenhook/PIC-Assembler/device_includes/pic16f17545.inc
#define TMR3L5                           BANKMASK(TMR3L), 5
#define TMR3L6                           BANKMASK(TMR3L), 6
#define TMR3L7                           BANKMASK(TMR3L), 7
#define TMR3MD                           BANKMASK(PMD1), 1
#define TMR3ON                           BANKMASK(T3CON), 0
#define TMR4IE                           BANKMASK(PIE2), 3
#define TMR4IF                           BANKMASK(PIR2), 3
#define TMR4MD                           BANKMASK(PMD1), 3
#define TMR4ON                           BANKMASK(T4CON), 7
#define TOSH0                            BANKMASK(TOSH), 0
#define TOSH1                            BANKMASK(TOSH), 1
#define TOSH2                            BANKMASK(TOSH), 2
#define TOSH3                            BANKMASK(TOSH), 3
#define TOSH4                            BANKMASK(TOSH), 4
#define TOSH5                            BANKMASK(TOSH), 5
#define TOSH6                            BANKMASK(TOSH), 6
#define TOSH7                            BANKMASK(TOSH), 7
#define TOSL0                            BANKMASK(TOSL), 0
#define TOSL1                            BANKMASK(TOSL), 1
#define TOSL2                            BANKMASK(TOSL), 2
#define TOSL3                            BANKMASK(TOSL), 3
#define TOSL4                            BANKMASK(TOSL), 4
#define TOSL5                            BANKMASK(TOSL), 5
#define TOSL6                            BANKMASK(TOSL), 6
#define TOSL7                            BANKMASK(TOSL), 7
#define TRISA0                           BANKMASK(TRISA), 0
#define TRISA1                           BANKMASK(TRISA), 1
#define TRISA2                           BANKMASK(TRISA), 2
#define TRISA4                           BANKMASK(TRISA), 4
#define TRISA5                           BANKMASK(TRISA), 5
#define TRISB4                           BANKMASK(TRISB), 4
#define TRISB5                           BANKMASK(TRISB), 5
#define TRISB6                           BANKMASK(TRISB), 6
#define TRISB7                           BANKMASK(TRISB), 7
#define TRISC0                           BANKMASK(TRISC), 0
#define TRISC1                           BANKMASK(TRISC), 1
#define TRISC2                           BANKMASK(TRISC), 2
#define TRISC3                           BANKMASK(TRISC), 3
#define TRISC4                           BANKMASK(TRISC), 4
#define TRISC5                           BANKMASK(TRISC), 5
#define TRISC6                           BANKMASK(TRISC), 6
#define TRISC7                           BANKMASK(TRISC), 7
#define TSEN                             BANKMASK(FVRCON), 5
#define TSRNG                            BANKMASK(FVRCON), 4
#define TUN0                             BANKMASK(OSCTUNE), 0
#define TUN1                             BANKMASK(OSCTUNE), 1
#define TUN2                             BANKMASK(OSCTUNE), 2
#define TUN3                             BANKMASK(OSCTUNE), 3
#define TUN4                             BANKMASK(OSCTUNE), 4
#define TUN5                             BANKMASK(OSCTUNE), 5
#define TX1IE                            BANKMASK(PIE4), 6
#define TX1IF                            BANKMASK(PIR4), 6
#define TX2IE                            BANKMASK(PIE5), 0
#define TX2IF                            BANKMASK(PIR5), 0
#define UA1                              BANKMASK(SSP1STAT), 1
#define UA2                              BANKMASK(SSP2STAT), 1
#define UART1MD                          BANKMASK(PMD3), 1
#define UART2MD                          BANKMASK(PMD3), 2
#define UG                               BANKMASK(OPA1CON0), 3
#define UG0                              BANKMASK(OPA1CON0), 3
#define UTH0                             BANKMASK(ADUTHL), 0
#define UTH1                             BANKMASK(ADUTHL), 1
#define UTH10                            BANKMASK(ADUTHH), 2
#define UTH11                            BANKMASK(ADUTHH), 3
#define UTH12                            BANKMASK(ADUTHH), 4
#define UTH13                            BANKMASK(ADUTHH), 5
#define UTH14                            BANKMASK(ADUTHH), 6
#define UTH15                            BANKMASK(ADUTHH), 7
#define UTH2                             BANKMASK(ADUTHL), 2
#define UTH3                             BANKMASK(ADUTHL), 3
#define UTH4                             BANKMASK(ADUTHL), 4
#define UTH5                             BANKMASK(ADUTHL), 5
#define UTH6                             BANKMASK(ADUTHL), 6
#define UTH7                             BANKMASK(ADUTHL), 7
#define UTH8                             BANKMASK(ADUTHH), 0
#define UTH9                             BANKMASK(ADUTHH), 1
#define UTHR                             BANKMASK(ADSTAT), 6
#define VLPDACEN                         BANKMASK(VLPCON), 6
#define VLPDACV0                         BANKMASK(VLPDACV), 0
#define VLPDACV1                         BANKMASK(VLPDACV), 1
#define VLPDACV2                         BANKMASK(VLPDACV), 2
#define VLPDACV3                         BANKMASK(VLPDACV), 3
#define VLPDACV4                         BANKMASK(VLPDACV), 4
#define VLPDACV5                         BANKMASK(VLPDACV), 5
#define VLPDOP                           BANKMASK(VLPCON), 0
#define VLPDSEL                          BANKMASK(VLPCON), 1
#define VLPEN                            BANKMASK(VLPCON), 7
#define VLPRDY                           BANKMASK(VLPCON), 5
#define VREFLPMD                         BANKMASK(PMD5), 1
#define WCOL1                            BANKMASK(SSP1CON1), 7
#define WCOL2                            BANKMASK(SSP2CON1), 7
#define WDTCS0                           BANKMASK(WDTCON1), 4
#define WDTCS1                           BANKMASK(WDTCON1), 5
#define WDTCS2                           BANKMASK(WDTCON1), 6
#define WDTPS0                           BANKMASK(WDTCON0), 1
#define WDTPS1                           BANKMASK(WDTCON0), 2
#define WDTPS2                           BANKMASK(WDTCON0), 3
#define WDTPS3                           BANKMASK(WDTCON0), 4
#define WDTPS4                           BANKMASK(WDTCON0), 5
#define WDTPSCNT16                       BANKMASK(WDTTMR), 0
#define WDTPSCNT17                       BANKMASK(WDTTMR), 1
#define WDTSEN                           BANKMASK(WDTCON0), 0
#define WDTSTATE                         BANKMASK(WDTTMR), 2
#define WDTTMR0                          BANKMASK(WDTTMR), 3
#define WDTTMR1                          BANKMASK(WDTTMR), 4
#define WDTTMR2                          BANKMASK(WDTTMR), 5
#define WDTTMR3                          BANKMASK(WDTTMR), 6
#define WDTTMR4                          BANKMASK(WDTTMR), 7
#define WDTWINDOW0                       BANKMASK(WDTCON1), 0
#define WDTWINDOW1                       BANKMASK(WDTCON1), 1
#define WDTWINDOW2                       BANKMASK(WDTCON1), 2
#define WINDOW0                          BANKMASK(WDTCON1), 0
#define WINDOW1                          BANKMASK(WDTCON1), 1
#define WINDOW2                          BANKMASK(WDTCON1), 2
#define WPUA0                            BANKMASK(WPUA), 0
#define WPUA1                            BANKMASK(WPUA), 1
#define WPUA2                            BANKMASK(WPUA), 2
#define WPUA3                            BANKMASK(WPUA), 3
#define WPUA4                            BANKMASK(WPUA), 4
#define WPUA5                            BANKMASK(WPUA), 5
#define WPUB4                            BANKMASK(WPUB), 4
#define WPUB5                            BANKMASK(WPUB), 5
#define WPUB6                            BANKMASK(WPUB), 6
#define WPUB7                            BANKMASK(WPUB), 7
#define WPUC0                            BANKMASK(WPUC), 0
#define WPUC1                            BANKMASK(WPUC), 1
#define WPUC2                            BANKMASK(WPUC), 2
#define WPUC3                            BANKMASK(WPUC), 3
#define WPUC4                            BANKMASK(WPUC), 4
#define WPUC5                            BANKMASK(WPUC), 5
#define WPUC6                            BANKMASK(WPUC), 6
#define WPUC7                            BANKMASK(WPUC), 7
#define WR                               BANKMASK(NVMCON1), 1
#define WREN                             BANKMASK(NVMCON1), 2
#define WRERR                            BANKMASK(NVMCON1), 3
#define XOR0                             BANKMASK(CRCXORL), 0
#define XOR1                             BANKMASK(CRCXORL), 1
#define XOR10                            BANKMASK(CRCXORH), 2
#define XOR11                            BANKMASK(CRCXORH), 3
#define XOR12                            BANKMASK(CRCXORH), 4
#define XOR13                            BANKMASK(CRCXORH), 5
#define XOR14                            BANKMASK(CRCXORH), 6
#define XOR15                            BANKMASK(CRCXORH), 7
#define XOR16                            BANKMASK(CRCXORU), 0
#define XOR17                            BANKMASK(CRCXORU), 1
#define XOR18                            BANKMASK(CRCXORU), 2
#define XOR19                            BANKMASK(CRCXORU), 3
#define XOR2                             BANKMASK(CRCXORL), 2
#define XOR20                            BANKMASK(CRCXORU), 4
#define XOR21                            BANKMASK(CRCXORU), 5
#define XOR22                            BANKMASK(CRCXORU), 6
#define XOR23                            BANKMASK(CRCXORU), 7
#define XOR24                            BANKMASK(CRCXORT), 0
#define XOR25                            BANKMASK(CRCXORT), 1
#define XOR26                            BANKMASK(CRCXORT), 2
#define XOR27                            BANKMASK(CRCXORT), 3
#define XOR28                            BANKMASK(CRCXORT), 4
#define XOR29                            BANKMASK(CRCXORT), 5
#define XOR3                             BANKMASK(CRCXORL), 3
#define XOR30                            BANKMASK(CRCXORT), 6
#define XOR31                            BANKMASK(CRCXORT), 7
#define XOR4                             BANKMASK(CRCXORL), 4
#define XOR5                             BANKMASK(CRCXORL), 5
#define XOR6                             BANKMASK(CRCXORL), 6
#define XOR7                             BANKMASK(CRCXORL), 7
#define XOR8                             BANKMASK(CRCXORH), 0
#define XOR9                             BANKMASK(CRCXORH), 1
#define ZCDIE                            BANKMASK(PIE6), 2
#define ZCDIF                            BANKMASK(PIR6), 2
#define ZCDINTN                          BANKMASK(ZCDCON), 0
#define ZCDINTP                          BANKMASK(ZCDCON), 1
#define ZCDMD                            BANKMASK(PMD4), 7
#define ZCDOUT                           BANKMASK(ZCDCON), 5
#define ZCDPOL                           BANKMASK(ZCDCON), 4
#define ZCDSEN                           BANKMASK(ZCDCON), 7
#define ZERO                             BANKMASK(STATUS), 2
#define nADDRESS1                        BANKMASK(SSP1STAT), 5
#define nADDRESS2                        BANKMASK(SSP2STAT), 5
#define nBOR                             BANKMASK(PCON0), 0
#define nMEMV                            BANKMASK(PCON1), 1
#define nPD                              BANKMASK(STATUS), 3
#define nPOR                             BANKMASK(PCON0), 1
#define nRI                              BANKMASK(PCON0), 2
#define nRMCLR                           BANKMASK(PCON0), 3
#define nRWDT                            BANKMASK(PCON0), 4
#define nT1SYNC                          BANKMASK(T1CON), 2
#define nT3SYNC                          BANKMASK(T3CON), 2
#define nTO                              BANKMASK(STATUS), 4
#define nWDTWV                           BANKMASK(PCON0), 5
#define nWRITE1                          BANKMASK(SSP1STAT), 2
#define nWRITE2                          BANKMASK(SSP2STAT), 2

/*
 * Device Psects
 */

#ifdef _XC_INC_

// Memory Spaces
#define SPACE_CODE   0
#define SPACE_DATA   1
#define SPACE_EEPROM 3

psect udata_shr,class=COMMON,space=SPACE_DATA,noexec
psect udata,class=RAM,space=SPACE_DATA,noexec
psect udata_bank0,class=BANK0,space=SPACE_DATA,noexec
psect udata_bank1,class=BANK1,space=SPACE_DATA,noexec
psect udata_bank2,class=BANK2,space=SPACE_DATA,noexec
psect udata_bank3,class=BANK3,space=SPACE_DATA,noexec
psect udata_bank4,class=BANK4,space=SPACE_DATA,noexec
psect udata_bank5,class=BANK5,space=SPACE_DATA,noexec
psect udata_bank6,class=BANK6,space=SPACE_DATA,noexec
psect udata_bank7,class=BANK7,space=SPACE_DATA,noexec
psect udata_bank8,class=BANK8,space=SPACE_DATA,noexec
psect udata_bank9,class=BANK9,space=SPACE_DATA,noexec
psect udata_bank10,class=BANK10,space=SPACE_DATA,noexec
psect udata_bank11,class=BANK11,space=SPACE_DATA,noexec
psect udata_bank12,class=BANK12,space=SPACE_DATA,noexec
psect code,class=CODE,space=SPACE_CODE,delta=2
psect data,class=STRCODE,space=SPACE_CODE,delta=2,noexec
psect edata,class=EEDATA,space=SPACE_EEPROM,delta=2,noexec

#endif // _XC_INC_

#endif // _PIC16F17545_INC_
